Catalogs/СохраненныеВыборкиПоПокупателям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СохраненныеВыборкиПоПокупателям</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецРежимВыборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпецРежимыВыборокПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекДляСпецРежима</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпецРежимыВыборокПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпецРежимыВыборокПокупателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупателиВкусвилл4РазаНеМенее7000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартаНаКоторуюОбъединялисьНесколькоКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаньшеПокупалиОпределенныйТоварСейчасНет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаньшеПокупалиОпределенныйТоварСейчасНетНоПокупаютДругой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупаютПятьОпределенныхПродуктовНоНеПокупаютШестой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярноПокупаютПродуктОтРазныхПоставщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АнализРегулярныхПосещений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярноПокупаютНаСуммуВМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупаютПродукциюНоНеПокупаютСвежуюВыпечку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярноПокупаютКулинарию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупаютНаСуммуЧека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупаютМинимумРазВНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПосещенияЗаПериодСреднийЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупаютВМагазинахРегиона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СохраненныеВыборкиПоПокупателям/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьОтборы()
			    
	ТекОтборы = Объект.Ссылка.ХранилищеОтбора.Получить();
	СписокПокупатели.Отбор.Элементы.Очистить();
	
	Если ТекОтборы <> Неопределено Тогда
				
		Для каждого ТекСтр Из ТекОтборы.Элементы Цикл
			
			НовыйОтбор = СписокПокупатели.Отбор.Элементы.Добавить(ТипЗнч(ТекСтр));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ТекСтр);
			Попытка
				Если ТекСтр.Элементы.Количество() > 0 Тогда
					ДобавитьПодчинённыеОтборы(ТекСтр, НовыйОтбор);
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
	// +++ АК CHUM 20.09.2017 0-00016384
	
	УстановитьЗапросСпискаДляСпецРежимов();
	
	ТекНастройки = Объект.Ссылка.ХранилищеНастроекДляСпецРежима.Получить();
	СписокДляСпецРежимов.Отбор.Элементы.Очистить();
	
	Если ТипЗнч(ТекНастройки) = Тип("Структура") Тогда
		
		ТекНастройки.Свойство("Период1", Период1);
		ТекНастройки.Свойство("Период2", Период2);
		
		ОтборДляСпецРежима = СписокДляСпецРежимов.Отбор;
		ТекНастройки.Свойство("ОтборДляСпецРежима", ОтборДляСпецРежима);
		
		Для Каждого ТекСтр Из ОтборДляСпецРежима.Элементы Цикл
			
			НовыйОтбор = СписокДляСпецРежимов.Отбор.Элементы.Добавить(ТипЗнч(ТекСтр));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ТекСтр);
			Попытка
				Если ТекСтр.Элементы.Количество() > 0 Тогда
					ДобавитьПодчинённыеОтборы(ТекСтр, НовыйОтбор);
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой = Новый ТаблицаЗначений;
		ОтборДляСпецРежимаПокупаютПятьНоНеШестой.Очистить();
		Если ТекНастройки.Свойство("ОтборДляСпецРежимаПокупаютПятьНоНеШестой", ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой) Тогда
			Для Каждого СтрТЗ Из ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой Цикл
				НовСтр = ОтборДляСпецРежимаПокупаютПятьНоНеШестой.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрТЗ);
			КонецЦикла;
		КонецЕсли;
		
		Если ТекНастройки.Свойство("НоменклатураКоторуюНеПокупают") Тогда
			НоменклатураКоторуюНеПокупают = ТекНастройки.НоменклатураКоторуюНеПокупают;
		КонецЕсли;
		
		Если ТекНастройки.Свойство("ПроизводительНоменклатурыКоторуюНеПокупают") Тогда
			ПроизводительНоменклатурыКоторуюНеПокупают = ТекНастройки.ПроизводительНоменклатурыКоторуюНеПокупают;
		КонецЕсли;
		
		Если ТекНастройки.Свойство("РегулярноПокупаемаяНоменклатура") Тогда
			РегулярноПокупаемаяНоменклатура = ТекНастройки.РегулярноПокупаемаяНоменклатура;
		КонецЕсли;
				
		Если ТекНастройки.Свойство("МинимальноеКоличествоРазныхПроизводителей") Тогда
			МинимальноеКоличествоРазныхПроизводителей = ТекНастройки.МинимальноеКоличествоРазныхПроизводителей;
		Иначе
			МинимальноеКоличествоРазныхПроизводителей = 2;
		КонецЕсли;
		//+++АК BARA 17252
		Если ТекНастройки.Свойство("РегулярностьПосещений") Тогда
			РегулярностьПосещений = ТекНастройки.РегулярностьПосещений;
		КонецЕсли;
		Если ТекНастройки.Свойство("ПериодИзмерений") Тогда
			ПериодИзмерений = ТекНастройки.ПериодИзмерений;
			ТекстПериодаИзмерений = Элементы.ПериодИзмерений.СписокВыбора.НайтиПоЗначению(ПериодИзмерений);
			Если ТекстПериодаИзмерений<>Неопределено Тогда				
				ПериодИзмерений = ТекстПериодаИзмерений.Представление;				
			КонецЕсли;
		КонецЕсли;
		Если ТекНастройки.Свойство("МагазинОтбора") Тогда
			МагазинОтбора = ТекНастройки.МагазинОтбора;
		КонецЕсли;
		Если ТекНастройки.Свойство("МинимальнаяСуммаЧека") Тогда
			МинимальнаяСуммаЧека = ТекНастройки.МинимальнаяСуммаЧека;
		КонецЕсли;
		Если ТекНастройки.Свойство("МаксимальнаяСуммаЧека") Тогда
			МаксимальнаяСуммаЧека = ТекНастройки.МаксимальнаяСуммаЧека;
		КонецЕсли;
		//---
		//+++АК BARA 17460
		Если ТекНастройки.Свойство("МинимальнаяСуммаПокупок") Тогда
			МинимальнаяСуммаПокупок = ТекНастройки.МинимальнаяСуммаПокупок;
		КонецЕсли;
		//---	
		//+++АК BARA 17798
		Если ТекНастройки.Свойство("СписокМагазинов") Тогда
			СписокМагазинов.ЗагрузитьЗначения(ТекНастройки.СписокМагазинов.ВыгрузитьЗначения());
		КонецЕсли; 
		//---	
		//---	
	КонецЕсли;
	// --- АК
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПодчинённыеОтборы(ТекСтрРодитель, НовыйОтборРодитель)
	
	Для каждого ТекСтр Из ТекСтрРодитель.Элементы Цикл
	    		
	    НовыйОтбор = НовыйОтборРодитель.Элементы.Добавить(ТипЗнч(ТекСтр));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ТекСтр);
		
		Попытка
		Если ТекСтр.Элементы.Количество() > 0 Тогда
			ДобавитьПодчинённыеОтборы(ТекСтр, НовыйОтбор);	
		КонецЕсли;	
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьОтборы();
	// +++ АК CHUM 20.09.2017 0-00016384
	ИзменитьВидимостьДоступностьЭлементов();
	// --- АК
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеОтбора = Новый ХранилищеЗначения(СписокПокупатели.Отбор);
	
	// +++ АК CHUM 20.09.2017 0-00016384
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Период1", Период1);
	СтруктураНастроек.Вставить("Период2", Период2);
	СтруктураНастроек.Вставить("ОтборДляСпецРежима", СписокДляСпецРежимов.Отбор);
	
	ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой = Новый ТаблицаЗначений;
	ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой.Колонки.Добавить("Производитель"	, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Для Каждого ТекСтр Из ОтборДляСпецРежимаПокупаютПятьНоНеШестой Цикл
		НовСтр = ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
	КонецЦикла;
	
	СтруктураНастроек.Вставить("ОтборДляСпецРежимаПокупаютПятьНоНеШестой"	, ТЗОтборДляСпецРежимаПокупаютПятьНоНеШестой);
	СтруктураНастроек.Вставить("НоменклатураКоторуюНеПокупают"				, НоменклатураКоторуюНеПокупают);
	СтруктураНастроек.Вставить("ПроизводительНоменклатурыКоторуюНеПокупают" , ПроизводительНоменклатурыКоторуюНеПокупают);
	
	СтруктураНастроек.Вставить("РегулярноПокупаемаяНоменклатура"						, РегулярноПокупаемаяНоменклатура);
	СтруктураНастроек.Вставить("МинимальноеКоличествоРазныхПроизводителей" 				, МинимальноеКоличествоРазныхПроизводителей);
	//+++АК BARA 17252	
	СтруктураНастроек.Вставить("РегулярностьПосещений", РегулярностьПосещений);
	СтруктураНастроек.Вставить("ПериодИзмерений", ПериодИзмерений);
	СтруктураНастроек.Вставить("МагазинОтбора", МагазинОтбора);
	СтруктураНастроек.Вставить("МинимальнаяСуммаЧека", МинимальнаяСуммаЧека);
	СтруктураНастроек.Вставить("МаксимальнаяСуммаЧека", МаксимальнаяСуммаЧека);	
	//---

	//+++АК BARA 2017.12.11 17460	
	СтруктураНастроек.Вставить("МинимальнаяСуммаПокупок", МинимальнаяСуммаПокупок);
	//--- АК
	//+++АК BARA 2018.01.30 17798	
	СтруктураНастроек.Вставить("СписокМагазинов", СписокМагазинов);
	//---АК
	
	ТекущийОбъект.ХранилищеНастроекДляСпецРежима = Новый ХранилищеЗначения(СтруктураНастроек);
	// --- АК
	
КонецПроцедуры

// +++ АК CHUM 20.09.2017 0-00016384

&НаСервере
Процедура СброситьНастройкиДляСпецРежимовВыборки()
	
	Период1 = "";
	Период2 = "";
	
	СписокДляСпецРежимов.ТекстЗапроса = "
		|ВЫБРАТЬ
		|	"""" КАК Для_данного_спец_режима_отборов_не_предусмотрено
		|";
	СписокДляСпецРежимов.Отбор.Элементы.Очистить();
	
	РегулярноПокупаемаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	МинимальноеКоличествоРазныхПроизводителей = 2;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапросСпискаДляСпецРежимов()
	
	СброситьНастройкиДляСпецРежимовВыборки();
	
	Если ЗначениеЗаполнено(Объект.СпецРежимВыборки) Тогда
		
		Если Объект.СпецРежимВыборки = Перечисления.СпецРежимыВыборокПокупателей.РаньшеПокупалиОпределенныйТоварСейчасНет
			ИЛИ Объект.СпецРежимВыборки = Перечисления.СпецРежимыВыборокПокупателей.РаньшеПокупалиОпределенныйТоварСейчасНетНоПокупаютДругой Тогда
			
			СписокДляСпецРежимов.ТекстЗапроса = "
				|ВЫБРАТЬ
				|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
				|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Производитель
				|";
			СписокДляСпецРежимов.Отбор.Элементы.Очистить();
			
		ИначеЕсли Объект.СпецРежимВыборки = Перечисления.СпецРежимыВыборокПокупателей.ПокупаютМинимумРазВНеделю Тогда //+++АК mika 2018.06.20 ИП-00018882
			
			СписокДляСпецРежимов.ТекстЗапроса = "
				|ВЫБРАТЬ
				|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
				|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК Магазин
				|";
			СписокДляСпецРежимов.Отбор.Элементы.Очистить();
			
		ИначеЕсли Объект.СпецРежимВыборки = Перечисления.СпецРежимыВыборокПокупателей.ПосещенияЗаПериодСреднийЧек Тогда //+++АК mika 2018.08.01 ИП-00019066
			
			СписокДляСпецРежимов.ТекстЗапроса = "
				|ВЫБРАТЬ
				|	Значение(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК Магазин,
				|	0 КАК КвоПосещений,
				|   0 КАК КвоДней,
				|	0 КАК МинСумма
				|";
			СписокДляСпецРежимов.Отбор.Элементы.Очистить();
			
		ИначеЕсли Объект.СпецРежимВыборки = Перечисления.СпецРежимыВыборокПокупателей.ПокупаютВМагазинахРегиона Тогда //+++АК mika 2018.08.01 ИП-00019066
			
			СписокДляСпецРежимов.ТекстЗапроса = "
				|ВЫБРАТЬ
				|	Значение(Справочник.Города.ПустаяСсылка) КАК Город,
				|   0 КАК КвоДней,
				|	0 КАК Процент
				|";
			СписокДляСпецРежимов.Отбор.Элементы.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЗначениеПоляКомпоновкиНаСервере(ТекЗначение, НовоеЗначение);
	
	СписокДляСпецРежимов.Отбор.Элементы.Получить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеПеречисленияСпецРежимаНаСервере(ИмяЗначения)
	Возврат Перечисления.СпецРежимыВыборокПокупателей[ИмяЗначения];
КонецФункции

&НаКлиенте
Процедура ИзменитьВидимостьДоступностьЭлементов()
	
	//+++АК BARA 17798 2018.01.30	
	Элементы.СписокМагазинов.Видимость = Ложь;
	Элементы.МагазинОтбора1.Видимость = Ложь;
	//---
	//+++АК BARA 17252	
	Элементы.Страница4.Видимость 			= Ложь;	
	//---	
	//+++АК BARA 174602	
	Элементы.МинимальнаяСуммаПокупок.Видимость 			= Ложь;	
	Элементы.ОтборПоКлиентам.Видимость = Истина;
	//---
	//+++АК BARA ИП-00017573  2017.12.29
	Элементы.МагазинОтбора1.Видимость = Ложь;
	//---	
	Если ЗначениеЗаполнено(Объект.СпецРежимВыборки) Тогда
		Элементы.ОтборДляСпецРежима.Доступность 	= Истина;
		Если Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("ПокупаютПятьОпределенныхПродуктовНоНеПокупаютШестой") Тогда
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Истина;
			Элементы.Страница3.Видимость 			= Ложь;
			//+++АК BARA   2017.12.29  Лишнее поле, похоже вверху включил видимость, а тут ее не выключил.
			Элементы.ОтборПоКлиентам.Видимость = Ложь;
			//---
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("РегулярноПокупаютПродуктОтРазныхПоставщиков") Тогда
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Истина;
			//+++АК BARA 17252	
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("АнализРегулярныхПосещений") Тогда  
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
			Элементы.Страница4.Видимость 			= Истина;	
			Элементы.ОтборПоКлиентам.Видимость   = Ложь;
			//---АК
			
			//+++АК BARA 17460
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("РегулярноПокупаютНаСуммуВМесяц") Тогда  
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
			Элементы.Страница4.Видимость 			= Ложь;	
			Элементы.МинимальнаяСуммаПокупок.Видимость= Истина;	
			Элементы.ОтборПоКлиентам.Видимость   = Ложь;
			//---АК BARA
			//+++АК BARA 17777 2018.01.29
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("РегулярноПокупаютКулинарию") Тогда  
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
			Элементы.Страница4.Видимость 			= Ложь;	
			Элементы.МинимальнаяСуммаПокупок.Видимость= Ложь;	
			Элементы.ОтборПоКлиентам.Видимость   = Ложь;
			Элементы.МагазинОтбора1.Видимость = Истина;
			//---АК BARA
			//+++АК BARA 17798 2018.01.30
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("ПокупаютНаСуммуЧека") Тогда  
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
			Элементы.Страница4.Видимость 			= Ложь;	
			Элементы.МинимальнаяСуммаПокупок.Видимость= Истина;	
			Элементы.ОтборПоКлиентам.Видимость   = Ложь;
			Элементы.СписокМагазинов.Видимость = Истина;
			Элементы.МагазинОтбора1.Видимость = Ложь;			
			//---АК BARA
			//+++АК BARA ИП-00017573  2017.12.29
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("ПокупаютПродукциюНоНеПокупаютСвежуюВыпечку") Тогда 
			Элементы.МагазинОтбора1.Видимость = Истина;	
			Элементы.МинимальнаяСуммаПокупок.Видимость = Истина;
			Элементы.Период2.Доступность 			= Ложь;
			Элементы.ОтборПоКлиентам.Видимость   = Ложь;
			Элементы.Страница1.Видимость 			= Ложь;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
			Элементы.Страница4.Видимость 			= Ложь;	
			//---АК BARA
		//+++АК mika 2018.06.20 ИП-00018882
		ИначеЕсли Объект.СпецРежимВыборки = ПолучитьЗначениеПеречисленияСпецРежимаНаСервере("ПокупаютМинимумРазВНеделю") Тогда  
			Элементы.Период2.Видимость   = Ложь;
			Элементы.Страница1.Видимость = Истина;
			Элементы.Страница2.Видимость = Ложь;
			Элементы.Страница3.Видимость = Ложь;
			Элементы.Страница4.Видимость = Ложь;	
			Элементы.ОтборПоКлиентам.Видимость = Ложь;
			Элементы.МагазинОтбора1.Видимость  = Ложь;
			Элементы.МинимальнаяСуммаПокупок.Видимость= Ложь;	
		//---АК mika 
		
		//+++АК mika 2018.08.03 ИП-00019066
	    ИначеЕсли Объект.СпецРежимВыборки = ПредопределенноеЗначение("Перечисление.СпецРежимыВыборокПокупателей.ПосещенияЗаПериодСреднийЧек") 
					ИЛИ Объект.СпецРежимВыборки = ПредопределенноеЗначение("Перечисление.СпецРежимыВыборокПокупателей.ПокупаютВМагазинахРегиона") Тогда  
			Элементы.Период1.Видимость   = Ложь;
			Элементы.Период2.Видимость   = Ложь;
			Элементы.Страница1.Видимость = Истина;
			Элементы.Страница2.Видимость = Ложь;
			Элементы.Страница3.Видимость = Ложь;
			Элементы.Страница4.Видимость = Ложь;	
			Элементы.ОтборПоКлиентам.Видимость = Ложь;
			Элементы.МагазинОтбора1.Видимость  = Ложь;
			Элементы.МинимальнаяСуммаПокупок.Видимость= Ложь;	  
		//---АК mika 
		
		Иначе
			Элементы.Период2.Доступность 			= Истина;
			Элементы.Страница1.Видимость 			= Истина;
			Элементы.Страница2.Видимость			= Ложь;
			Элементы.Страница3.Видимость 			= Ложь;
		КонецЕсли;
		
		Элементы.ОтборПоКлиентам.Доступность 		= Ложь;
	Иначе
		Элементы.ОтборДляСпецРежима.Доступность 	= Ложь;
		Элементы.ОтборПоКлиентам.Доступность 		= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпецРежимВыборкиПриИзменении(Элемент)
	
	ИзменитьВидимостьДоступностьЭлементов();
	УстановитьЗапросСпискаДляСпецРежимов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДляСпецРежимовОтборПриИзменении(Элемент)
	
	Если Найти(Строка(Элемент.ТекущиеДанные.ЛевоеЗначение), ".") <> 0 Тогда
		
		Для Каждого ЭлементОтбора Из СписокДляСпецРежимов.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Элемент.ТекущиеДанные.ЛевоеЗначение Тогда
				ЭлементОтбора.ЛевоеЗначение =Новый ПолеКомпоновкиДанных(Лев(Элемент.ТекущиеДанные.ЛевоеЗначение, Найти(Элемент.ТекущиеДанные.ЛевоеЗначение, ".") - 1));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
// --- АК
